CaseFolder/With_icoFoam/NS/NS/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (-3 0 0) //0
    (-1.5 0 0)	//1
    (-1.125	1.125 0)	//2
    (-3	1.125 0)	//3
    (-0.5 0 0)	//4
    (-0.353553390593274	0.353553390593274 0)	//5
    (0 0.5 0)	//6
    (0 1.5 0)	//7
 (0.353553390593274	0.353553390593274 0)	//8
(1.125	1.125 0)	//9
(0.5 0 0)	//10
(1.5 0 0)	//11
(5 0 0)	//12
(5	1.125 0)	//13
(5 5 0)	//14
(1.125	5 0)	//15
(0 5 0) //16
    (-1.125	5 0)	//17
    (-3 5 0)	//18
    
  (-3 0 0.1) //19
    (-1.5 0 0.1)	//20
    (-1.125	1.125 0.1)	//21
    (-3	1.125 0.1)	//22
    (-0.5 0 0.1)	//23
    (-0.353553390593274	0.353553390593274 0.1)	//24
    (0 0.5 0.1)	//25
    (0 1.5 0.1)	//26
 (0.353553390593274	0.353553390593274 0.1)	//27
(1.125	1.125 0.1)	//28
(0.5 0 0.1)	//29
(1.5 0 0.1)	//30
(5 0 0.1)	//31
(5	1.125 0.1)	//32
(5 5 0.1)	//33
(1.125	5 0.1)	//34
(0 5 0.1) //35
    (-1.125	5 0.1)	//36
    (-3 5 0.1)	//37

);

blocks
	(
	/*hex (0 1 2 3 19 20 21 22) (30 30 1) simpleGrading (1 1 1)	//0
	hex (1 4 5 2 20 23 24 21) (30 30 1) simpleGrading (1 1 1)	//1
	hex (2 5 6 7 21 24 25 26) (30 30 1) simpleGrading (1 1 1)	//2
	hex (2 7 16 17 21 26 35 36) (30 30 1) simpleGrading (1 1 1)	//3
	hex (3 2 17 18 22 21 36 37) (30 30 1) simpleGrading (1 1 1)	//4
	hex (9 8 10 11 28 27 29 30) (30 30 1) simpleGrading (1 1 1)	//5
	hex (11 12 13 9 30 31 32 28) (30 30 1) simpleGrading (1 1 1)	//6
	hex (9 13 14 15 28 32 33 34) (30 30 1) simpleGrading (1 1 1)	//7
	hex (7 9 15 16 26 28 34 35) (30 30 1) simpleGrading (1 1 1)	//8
	hex (7 6 8 9 26 25 27 28) (30 30 1) simpleGrading (1 1 1)	//9
*/
	hex (0 1 2 3 19 20 21 22) (20 10 1) simpleGrading (1 1 1)	//0
	hex (1 4 5 2 20 23 24 21) (10 10 1) simpleGrading (1 1 1)	//1
	hex (2 5 6 7 21 24 25 26) (10 10 1) simpleGrading (1 1 1)	//2
	hex (2 7 16 17 21 26 35 36) (10 50 1) simpleGrading (1 1 1)	//3
	hex (3 2 17 18 22 21 36 37) (20 50 1) simpleGrading (1 1 1)	//4
	hex (9 8 10 11 28 27 29 30) (10 10 1) simpleGrading (1 1 1)	//5
	hex (11 12 13 9 30 31 32 28) (50 10 1) simpleGrading (1 1 1)	//6
	hex (9 13 14 15 28 32 33 34) (50 50 1) simpleGrading (1 1 1)	//7
	hex (7 9 15 16 26 28 34 35) (10 50 1) simpleGrading (1 1 1)	//8
	hex (7 6 8 9 26 25 27 28) (10 10 1) simpleGrading (1 1 1)	//9

 
);

edges
(
  /*spline 4 5 ((-0.458257569495584 0.2 0))
spline 5 6 ((-0.3 0.4 0))
spline 6 8 ((0.3 0.4 0))
spline 8 10 ((0.458257569495584 0.2 0))
spline 1 2 ((-0.69 0.3 0))
spline 2 7 ((-0.45 0.6 0))
spline 7 9 ((0.45 0.6 0))
spline 9 11 ((0.69 0.3 0))

spline 23 24 ((-0.458257569495584 0.2 0.1))
spline 24 25 ((-0.3 0.4 0.1))
spline 25 27 ((0.3 0.4 0.1))
spline 27 29 ((0.458257569495584 0.2 0.1))
spline 20 21 ((-0.69 0.3 0.1))
spline 21 26 ((-0.45 0.6 0.1))
spline 26 28 ((0.45 0.6 0.1))
spline 28 30 ((0.69 0.3 0.1))
*/

arc 4 5 (-0.458257569495584 0.2 0)
arc 5 6 (-0.3 0.4 0)
arc 6 8 (0.3 0.4 0)
arc 8 10 (0.458257569495584 0.2 0)
arc 1 2 (-1.30873737341529 0.732943713682055 0)
arc 2 7 (-0.558737373415292  1.39205335657401 0)
arc 7 9 (0.558737373415292	1.39205335657401 0)
arc 9 11 (1.30873737341529	0.732943713682055 0)

arc 23 24 (-0.458257569495584 0.2 0.1)
arc 24 25 (-0.3 0.4 0.1)
arc 25 27 (0.3 0.4 0.1)
arc 27 29 (0.458257569495584 0.2 0.1)
arc 20 21 (-1.30873737341529 0.732943713682055 0.1)
arc 21 26 (-0.558737373415292  1.39205335657401 0.1)
arc 26 28 (0.558737373415292	1.39205335657401 0.1)
arc 28 30 (1.30873737341529	0.732943713682055 0.1)
);

boundary
(
    topBoundary
    {
        type symmetry;
        faces
        (
            (18 17 36 37)
            (17 16 35 36)
            (16 15 34 35)
            (15 14 33 34)
        );
    }
    subBoundary
    {
        type wall;
        faces
        (
            
            (4 23 24 5)
            (5 24 25 6)
            (6 25 27 8)
            (10 8 27 29)
                      

        );
    }
upStream
    {
        type patch;
        faces
        (
            (0 3 22 19)
            (3 18 37 22)
            
        );
    }

downStream
    {
        type patch;
        faces
        (
            (12 31 32 13)
            (13 32 33 14)
            
        );
    }
	bottomSymmetry
   {
      type symmetryPlane; 
       faces 
        ( 
            (0 19 20 1) 
            (1 20 23 4) 
            (10 29 30 11)
            (11 30 31 12)
	     
        ); 
	}
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (1 4 5 2)
            (5 6 7 2)
            (2 7 16 17)
            (3 2 17 18)
            (10 11 9 8)
            (11 12 13 9)
            (9 13 14 15)
            (7 9 15 16)
            (6 8 9 7)
            (19 20 21 22)
            (20 23 24 21)
            (24 25 26 21)
            (21 26 35 36)
            (22 21 36 37)
            (29 30 28 27)
	(30 31 32 28)
	(28 32 33 34)
	(26 28 34 35)
	(25 27 28 26)
        );
    }
   
);

mergePatchPairs
(
);

// ************************************************************************* //
